Конфигурация/src/Documents/КорректировкаУчебногоПлана/КорректировкаУчебногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаУчебногоПлана</name>
  <registerRecords>InformationRegister.ПараметрыУчебногоПлана</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПлан</name>
    <type>
      <types>CatalogRef.УчебныеПланы</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Дисциплины</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗачетныеЕдиницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОценки</name>
      <type>
        <types>EnumRef.ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/ПараметрыУчебногоПлана/ПараметрыУчебногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыУчебногоПлана</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетныеЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОценки</name>
    <type>
      <types>EnumRef.ВидыОценок</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчебныйПлан</name>
    <type>
      <types>CatalogRef.УчебныеПланы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Documents/КорректировкаУчебногоПлана/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ПараметрыУчебногоПлана.Записывать = Истина;

	Для Каждого СтрокаДисциплины Из Дисциплины Цикл

		Если НЕ ЗначениеЗаполнено(УчебныйПлан) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаДисциплины.Дисциплина) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ПараметрыУчебногоПлана.Добавить();
		Движение.Период = Дата;
		Движение.УчебныйПлан = УчебныйПлан;
		Движение.Дисциплина = СтрокаДисциплины.Дисциплина;
		Движение.Семестр = СтрокаДисциплины.Семестр;
		Движение.КоличествоЧасов = СтрокаДисциплины.КоличествоЧасов;
		Движение.ЗачетныеЕдиницы = СтрокаДисциплины.ЗачетныеЕдиницы;
		Движение.ВидОценки = СтрокаДисциплины.ВидОценки;
		Движение.УчебныйПериод = УчебныйПериод;

	КонецЦикла;

КонецПроцедуры
